print('Задача 4. Площадь треугольника')

# Напишите программу,
# которая запрашивает у пользователя длины двух катетов
# в прямоугольном треугольнике и выводит его площадь.

# Формула:
# S = ab/2
a = int(input('Введите длину катета - a:'))
b = int(input('Введите длину катета - b:'))
print('Площадь S=', a*b/2)